Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ཚེ་སྦྱིན་པར་བྱེད། རྒྱལ་པོ་དག་ཡུལ་སྦྱིན་པར་བྱེད་དོ།
en: This pill prolongs life and brings prosperity to kings. “

source: །ཐིག་ལེ་བྱས་ཏེ་གཡུལ་ངོར་སོང་ན་ཐམས་ཅད་ལས་རྟག་ཏུ་རྒྱལ་བ་དང་།
en: If the vidyā holder makes a bindi with the infusion and goes into battle, he will always be victorious.

source: བུད་མེད་རྣམས་དགའ་བ་དང་།
en: The wearer of such a bindi will be delightful to women.

source: དབང་དུ་འགྱུར་བར་བྱེད་པའི་མཆོག་ཡིན་ནོ། །བྱད་འཇོམས་ཤིང་དུག་དང་།
en: This is the ultimate enthrallment.

source: དབྱིག་དུག་དང་། ཕྱེ་མའི་དུག་དང་། གསང་སྔགས་ཀྱི་སྦྱོར་བ་དག་ཀྱང་དེ་བཞིན་ནོ། །ཟས་ཟ་བ་དང་ཁྲུས་བྱེད་པ་ན་ཐིག་ལེའི་བྱུག་པ་རྟག་ཏུ་བྱས་ན། དེ་ཐམས་ཅད་ལས་འགྲོ་བ་རྣམས་བདེ་བར་ཐར་བར་འགྱུར་རོ་ཞེས་འཇིག་རྟེན་དབང་ཕྱུག་གསུང་ངོ་།
en: And, as the Lokeśvara has said, all those who apply the powder—whether in the form of a bindi or ointment, or if they eat it or bathe in it—will easily overcome the problems in this world caused by kākhordas, poisons, garas, or the magic involving poisonous powders or mantras.

source: །ཀླད་པའི་ནད་མི་བཟད་པ་ལ་ནི་བྱུག་པར་བྱའོ། །མིག་ན་བ་ལ་ནི་མིག་སྨན་གྱི་ཐུར་མས་སོ།
en: For headache, the pill can be applied as an ointment for the head, and for eye pain, as an ointment for the eyes.

source: །སོ་ན་བ་ལ་ནི་ཁར་མུར་རོ། །ལྟོ་ན་བ་ལ་ནི་ཆུ་དྲོན་དང་ངོ་།
en: It can be held in the mouth for toothaches, taken with warm water for abdominal pain, and rubbed in with ghee for pain in the flanks.

source: །རྩིབ་ལོགས་ན་བ་ལ་ནི་མར་དང་བྱུག་གོ།
en: One should use the ointment mixed with ghee.

source: །ཡན་ལག་དང་ཉིང་ལག་ན་བ་ལ་ནི་བསྐུ་བར་བྱའོ།
en: For aches in the body or limbs, it can be rubbed evenly into the affected area. “

source: །དབང་དུ་བྱ་བ་ནི་ལག་མཐིལ་ལ་བསྐུ་བས་སོ།
en: For effecting enthrallment, the vidyā holder should anoint the palm of his hand.

source: །ནད་ཚབས་ཆེ་བ་ལ་ནི་སྐུ་མཉེ་དང་ཁྲུས་བྱའོ།
en: In the case of serious illness, he should rub the ointment on his body and then bathe.

source: །གནོད་སྦྱིན་གྱི་གདོན་བསལ་བ་ལ་ནི་སྣ་ནས་བཏང་བའི་ལས་བྱའོ། །བདུག་པས་ནི་གདོན་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བར་འགྱུར་རོ།
en: To destroy yakṣas and grahas, he should burn the pill as incense while holding it in his hand; he will then be freed from all grahas.

source: །རྒྱས་ཐེབས་པ་ལ་ནི་མཚོག་མར་ཐིག་ལེ་བྱའོ།
en: To counter the harmful influence of mudrās, he should make a bindi mark on the crown of the head.

source: །སྙིང་ན་བ་ལ་ནི་ཆུ་དྲོན་དང་ལན་ཚ་བསྲེས་པའོ།
en: For diseases of the heart, he should mix the pill with hot water and salt.

source: །ཁྱིམ་ཞི་བར་བྱ་ལ་ནི་འབྲས་ཡོས་དང་གསུམ་སྦྱར་བས་ཞི་བ་ཆེན་པོར་འགྱུར་རོ།
en: To pacify grahas, he should add three measures of parched rice; this will pacify them completely.

source: །ཐམས་ཅད་དུ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ནས་སོ།
en: In each case, the vidyā holder should incant the ingredients with the mantra twenty-one times. “

source: །འཐབ་པ་དང་། རྩོད་པ་རྣམས་ལ་ནི་བ་ལང་གི་ལྕི་བས་དཀྱིལ་འཁོར་བྱས་ལ་མེ་ཏོག་བཀྲམ་སྟེ། དྲི་ཆུས་བཀང་བ་བཞི་བཞག་ཅིང་འོ་མས་བཀང་བ་བཞི་དང་། མཆོད་ཡོན་གྱི་སྣོད་བཞི་དང་། པོག་ཕོར་བཞི་བཞག་སྟེ།
en: In the event of any quarrels, disputes, contests, or disagreements, the vidyā holder should draw a maṇḍala with cow dung, scatter flowers, and arrange four bowls with scented powders, four bowls filled with milk, four bowls with argha water, and four incense burners lit with agarwood and olibanum.

source: ཨ་ག་རུ་དང་དུ་རུ་སྐས་བདུག་གོ། །གུ་གུལ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ་བདུག་པར་བྱའོ།
en: He should also burn frankincense that has been incanted twenty-one times.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་དྲི་ཆབ་ཀྱིས་མཆོད་པར་བྱའོ།
en: He should then make offerings to a figure of Noble Avalokiteśvara made from fragrant substances.

source: །ཁྲོ་བོའི་རྒྱལ་པོ་ཡུངས་ཀར་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ་ཕྱོགས་བཞིར་གཏོར་བར་བྱའོ།
en: Having incanted mustard seeds by reciting the Krodharāja one hundred and eight times, he should cast the seeds in the four directions.

source: །དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་དགུ་བཅུ་རྩ་གཅིག་བཟླས་ན།
en: He should mindfully repeat the heart mantra of Amoghapāśa ninety-one times.

source: འཐབ་པ་དང་། རྩོད་པ་རྣམས་ལ་སྨྲ་བའི་མཆོག་ཏུ་འགྱུར་རོ། །གཡུལ་འགྱེད་པ་ལས་རྒྱལ་བར་འགྱུར་རོ།
en: He will then emerge victorious in all quarrels, disputes, contests, and squabbles.

source: །རང་གི་དཔུང་དང་གཞན་གྱི་དཔུང་ཡན་ལག་བཞི་པ་ཐམས་ཅད་ལས་རྒྱལ་བར་འགྱུར་རོ།
en: He will also win all battles and armed conflicts, defeating all four divisions of every army, including his own and the enemy’s.

source: །གལ་ཏེ་བརྒྱ་བྱིན་རང་དང་། ལྷ་མ་ཡིན་ལྷན་ཅིག་པས་ཀྱང་མ་ཡིན་ན། མི་རྣམས་ཀྱིས་ལྟ་ཅི་སྨོས།
en: If he can win over Śakra together with the asuras, what need is there to mention ordinary humans? “

source: བརྒྱ་བྱིན་དགུག་པར་འདོད་ན་པདྨ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ། བརྒྱ་བྱིན་གྱི་མིང་ནས་བརྗོད་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་རེ་རེ་ནས་དབུལ་བར་བྱ་ཞིང་།
en: If the vidyā holder wants to summon Śakra, he should incant lotus flowers one hundred and eight times and offer them one by one to the figure of Noble Avalokiteśvara made of fragrant substances while reciting Śakra’s name.

source: དྲི་ཆབ་ཀྱང་དབུལ་ལོ། །གུ་གུལ་དང་། མར་དང་ཡུངས་ཀར་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ།
en: He should offer one hundred and eight oblations of mustard seeds, bdellium, and ghee, incanting each with the mantra.

source: ཤིང་ཨརྐའི་མེ་སྦར་ལ་ཚེས་བཅུ་བཞི་ལ་སྦྱིན་སྲེག་བྱའོ།
en: To do this, he should make fire with the sticks of giant milkweed and perform this rite on the fourteenth lunar day, before the full moon.

source: །བཟླས་བརྗོད་ཀྱི་ཆོ་ག་རྫོགས་པ་དང་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་དཔུང་དང་བཞོན་པར་བཅས་པ་འོངས་ནས་མདུན་དུ་འདུག་སྟེ།
en: When the vidyā holder has completed the recitation procedure, Śakra, the king of gods, will descend with his army and appear before the vidyā holder, ready to carry out his orders.

source: བསྒོ་བ་བཞིན་བྱེད་ཅིང་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: They will all fall under his thrall.

source: །བརྒྱ་བྱིན་གྱི་གོ་འཕང་མ་གཏོགས་པ་གང་བསླངས་པ་དེ་སྦྱིན་པར་བྱེད་དེ་དེ་ནི་སེམས་མི་བཟོད་དོ།
en: Śakra will give him anything he asks for, including the rank of Śakra, without hesitation. “

source: །ཚངས་པ་རྡོག་པས་མནན་ཏེ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ན་བརྒྱ་རྩ་བརྒྱད་ཚང་བ་དང་།
en: Placing his foot on a figure of Brahmā, the vidyā holder should recite the mantra one hundred and eight times.

source: ཚངས་པ་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་འདུག་སྟེ། མཆོག་ཐམས་ཅད་སྦྱིན་པར་བྱེད་དོ། །ཡིད་ལ་ཅི་འདོད་པ་སྒྲུབ་པར་བྱེད་དོ།
en: When he has reached this number, Brahmā will appear before him in person and offer any boon, granting whatever the vidyā holder wishes.

source: །གུ་གུལ་ལ་ལན་དགུ་བཅུ་བཟླས་ཏེ། ཁྱབ་འཇུག་ལ་བདུག་ཅིང་ཆུ་དང་ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ་སྤྱི་བོར་གཏོར་ན།
en: To summon Nārāyaṇa, the vidyā holder should incant bdellium ninety times and offer it to Nārāyaṇa as incense, along with water and mustard seeds incanted twenty-one times.

source: ཁྱབ་འཇུག་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་འདུག་ཅིང་ལས་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ།
en: Nārāyaṇa will appear before the vidyā holder in person and will perform all his tasks.

source: །གཟུགས་སྣ་ཚོགས་ཀྱི་བར་དུ་སྟོན་ཏོ། །ཧི་ར་ཎྱ་ཀ་ཤི་བུ་ལ་ཡང་སྦྱིན་པར་བྱེད་ཅིང་ཁྱབ་འཇུག་ཆེན་པོའི་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་པར་འགྱུར་རོ།
en: He will grant him a great variety of forms and give him control over Hiraṇyakaśipu. The vidyā holder will obtain the powerful force of the great Nārāyaṇa. “

source: །དབང་ཕྱུག་ཆེན་པོའི་ཞལ་མཐོང་བར་འདོད་ན། རྣ་བ་གཡས་པར་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ་ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ནས་སྤྱི་བོར་གཏོར་རོ།
en: Gazing at the face of a figure of Maheśvara, the vidyā holder should incant the figure’s right ear one hundred and eight times with the mantra and sprinkle its head with mustard seeds incanted twenty-one times.

source: །གུ་གུལ་གྱི་བདུག་པས་བདུག་ཅིང་། ཨརྐའི་ཆུ་ལ་ལན་བདུན་བཟླས་ཏེ་དབུལ་བར་བྱའོ།
en: He should also burn incense of bdellium and offer argha water for washing the feet incanted seven times.

source: །དེ་ནས་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་འགུལ་བར་འགྱུར་ཞིང་ལེགས་སོ་ཞེས་བྱ་བར་སྒྲ་འབྱུང་ངོ་།
en: At that moment, the figure of Maheśvara will begin to move, and the word ‘good!’ will sound.

source: །དེ་ནས་དབང་ཕྱུག་ཆེན་པོ་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་འདུག་པར་འགྱུར་ཞིང་། རང་གི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ། །འདོད་པའི་མཆོག་ཐམས་ཅད་སྦྱིན་པར་མཛད་དོ། །མཆོག་གང་འདོད་པ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་དོ།
en: The god will then appear before the vidyā holder in person, he and his retinue will all fall under the vidyā holder’s thrall, and Maheśvara will fulfill all wishes and grant every boon. “

source: །ནག་པོ་ཆེན་པོ་དགུག་པར་འདོད་པས་གུ་གུལ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ། ཁྲག་དང་ཆང་དབུལ་བར་བྱ་ཞིང་།
en: If the vidyā holder wants to summon Mahākāla, he should burn bdellium incense incanted with the mantra one hundred and eight times and offer blood and wine.

source: ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ནས། ནག་པོ་ཆེན་པོའི་སྟེང་དུ་གཏོར་ན་ཁུགས་པར་འགྱུར་ཏེ།
en: He should incant mustard seeds twenty-one times and sprinkle them on top of an image of Mahākāla.

source: བྲན་བཞིན་དུ་ལས་ཐམས་ཅད་བྱེད་པར་འགྱུར་ཞིང་།
en: Mahākāla will then be summoned, and like a servant he will perform all kinds of duties.

source: གར་མངགས་པ་དེར་འགྲོ་བར་འགྱུར་རོ། །འཁོར་གྱི་ཚོགས་དང་བཅས་པ་དབང་དུ་འགྱུར་རོ།
en: He will go wherever he is commanded, as will his retinue and followers.

source: །གནོད་སྦྱིན་གྱི་གནས་ཐམས་ཅད་ཀྱི་སྒོ་འབྱེ་བར་འགྱུར་ཞིང་གང་འདོད་པ་བྱེད་དོ།
en: The vidyā holder will find all the doors to yakṣa dwellings open, and he will be able to do whatever he wants.

source: །ཐམས་ཅད་བྱམས་པར་འགྱུར་ཞིང་ལས་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ།
en: All the grasses will be well disposed to him, and all yakṣas will love him and perform all his tasks. “

source: །མི་སྨྲ་བར་མཚན་མོའི་དུས་མཚམས་གསུམ་དུ་ལན་ཉི་ཤུ་རྩ་རེ་རེ་བཟླས་ན་མཚན་མོའི་ལྷ་འཁོར་དང་བཅས་པ་དང་། མཚན་མོ་རྒྱུ་བ་དང་། ཉིན་པར་རྒྱུ་བའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: If the vidyā holder recites the mantra twenty-one times at the three junctions of the night without saying any other words, the deities of the night together with their retinues and followers will all fall under his thrall.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་ཐམས་ཅད་དབང་དུ་འགྱུར་ཏེ།
en: This includes beings active during the day or at night, such as devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and other nonhuman and human beings.

source: ལས་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ།
en: They will perform every task.

source: །ཐམས་ཅད་རང་གི་གཟུགས་ཀྱིས་རྟག་ཏུ་མདུན་ན་ཉེ་བར་གནས་སོ། །མཚན་མོ་ལོངས་སྤྱོད་པར་གཞལ་མེད་ཁང་ཐམས་ཅད་སྦྱིན་པར་བྱེད་དོ།
en: They will all remain close to the vidyā holder at all times and will provide him with palaces to use for his nightly pleasure. “

source: །གཙང་མས་གོས་གཙང་མ་བགོས་ཏེ། ཁྲུས་ལེགས་པར་བྱས་ནས་བདེན་པར་སྨྲ་ཞིང་བྱམས་པའི་སེམས་ཉེ་བར་བཞག་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་རྟག་ཏུ་བརྩེ་བ་དང་སྙིང་རྗེ་ཆེན་པོས་ལྷག་པར་དམིགས་ཏེ་བཟླས་བརྗོད་རྟག་ཏུ་བྱའོ།
en: The vidyā holder should be ritually pure, wear clean clothes, be thoroughly bathed, speak the truth, cultivate loving thoughts, and always maintain kindness for all beings. Filled with great compassion, he should recite the mantra continually. “

source: །བཟླས་བརྗོད་ཀྱི་ཆོ་ག་རིམ་པར་ཕྱེ་བའོ།
en: This concludes the section on the recitation procedure. “Now I will teach the homa rite that accomplishes every activity, both the auspicious activities of pacifying and nourishing and the activities of assault.

source: །དེ་ནས་རྟག་ཏུ་ལས་ཐམས་ཅད་བྱེད་པ་དགེ་བཞི་བ་རྒྱས་པ་དྲག་ཤུལ་སྤྱོད་པ་སྲུང་བ་ནད་ཐམས་ཅད་སེལ་པ། བྱང་འཇིག་པ། དབང་དུ་བྱེད་པ།
en: This rite affords protection, removes all diseases, destroys the kākhordas, and enthralls without fail.

source: སྦྱིན་སྲེག་གི་ཆོ་ག་བཤད་པར་བྱའོ། །ཁྱིམ་སྲུང་བར་འདོད་པས་ཨརྒའི་ཡམ་སྲེག་ཤིང་དང་། པདྨ་དང་། ཡུངས་མར་བསྲེས་པ་ལས་སྦྱིན་སྲེག་ལན་བརྒྱ་རྩ་བརྒྱད་བྱས་ཏེ། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ལ།
en: If the vidyā holder wants to protect his home, he should smear lotus petals with mustard oil, make fire with the sticks of giant milkweed, and offer one hundred and eight oblations of the lotus petals while reciting the heart mantra one hundred and eight times.

source: ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བདུན་བཟླས་བརྗོད་བྱས་ན།
en: When that is complete, the vidyā holder should recite the Krodharāja mantra seven times.

source: ཁྱིམ་ཆེན་པོ་བསྲུང་བར་འགྱུར་རོ།
en: This will ensure effective protection of the house.

source: །འཐབ་པ་དང་། རྩོད་པ་དང་། ཁྲག་ཁྲུག་ཐམས་ཅད་དང་ཕྱིར་རྒོལ་བ་དང་། མི་མཛའ་བ་ཐམས་ཅད་དང་། རིམས་ཐམས་ཅད་དང་། ཡམས་ཀྱི་ནད་དང་། ནད་འགོ་བ་ཐམས་ཅད་དང་། གདོན་ཐམས་ཅད་དང་། མུ་གེའི་གནོད་པ་དང་།
en: All quarrels, disagreements, contests, and disputes will cease.

source: མི་ངས་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོའི་མི་ངས་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ།
en: All adversaries and opponents, all diseases, fevers, misfortunes, calamities, and catastrophes, as well as all grahas, famines, disasters, pestilences, and plagues, will be completely pacified for every woman, man, boy, and girl.

source: །ལྷ་ཐམས་ཅད་ཀྱང་སྲུང་བ་དང་སྐྱོབ་པ་དང་སྦ་བ་བྱེད་པར་འགྱུར་རོ།
en: All deities will be on hand to guard, protect, and defend the vidyā holder.

source: །དབང་ཕྱུག་དང་དབང་ཕྱུག་ཆེན་པོ་ཡང་རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་བར་འགྱུར་རོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཀྱང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སྐུ་སྟོན་པར་བཞེད་པར་འགྱུར་རོ། །སྦྱིན་སྲེག་གི་མར་དང་། ཡུངས་ཀར་དང་།
en: Īśvara and Maheśvara will always follow him, and Noble Avalokiteśvara will appear to him whenever the vidyā holder wants to see him. “

source: གུ་གུལ་གྱི་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ན། ཡུལ་དང་། ཡུལ་འཁོར་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་གྲུ་དང་། རི་ཁྲོད་དང་། ལྗོངས་རྣམས་ཞི་བ་ཆེན་པོར་འགྱུར་རོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྱན་སྔར་ཟླ་བ་ཉ་ལ་མེ་ཏོག་དཀར་པོ་དང་། གན་དྷ་པྲི་ཡང་ཀུ་དང་།
en: If the vidyā holder offers one thousand and eight oblations of ghee, mustard seeds, and bdellium, the entire realm—its cities, towns, villages, and settlements—will enjoy great peace.

source: རྒྱ་སྤོས་རྣམས་ཡུངས་མར་དང་བསྲེས་ཏེ་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ན་རྒྱལ་པོ་དང་། བློན་པོ་བཙུན་མོའི་འཁོར་དང་བཅས་པ་དང་། ཡུལ་གྲུ་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། རྟ་དང་། གླང་པོ་ཆེ་དང་།
en: If, during the full moon, the vidyā holder offers one thousand and eight oblations of fragrant white flowers—such as mahaleb cherry or crepe jasmine—smeared with mustard oil while in front of Noble Avalokiteśvara, the king and his ministers with their harems and retinues will fall under the vidyā holder’s thrall, as will the inhabitants of the cities, towns, villages, hamlets, and settlements, and elephants, horses, cattle, and buffalo. “

source: བ་ལང་དང་། མ་ཧེ་རྣམས་དབང་དུ་འགྱུར་རོ། །ཤིང་ཨ་པ་མརྒའི་ཡམ་སྲེག་ཤིང་ཞོ་དང་སྦྲང་རྩི་དང་། མར་བསྲེས་པ་དང་། མེ་ཏོག་དཀར་པོ་རྣམས་ལས་ལན་བརྒྱ་རྩ་བརྒྱད་སྦྱིན་སྲེག་བྱས་ན་ཡུལ་གྲུ་སྟོང་འཐོབ་པར་འགྱུར་རོ།
en: If the vidyā holder offers one thousand and eight oblations of white flowers smeared with curds, honey, and ghee into a fire made with sticks of chaff flower, he will obtain one thousand villages.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྱན་སྔར་ཞོ་དང་སྦྲང་རྩི་དང་མར་བསྲེས་པ་དང་པདྨའི་སྡོང་པོའི་ཡམ་སྲེག་ཤིང་རྣམས་ལས་བརྒྱ་རྩ་བརྒྱད་སྦྱིན་སྲེག་བྱས་ན་མཚན་མོ་ཟད་པ་དང་དི་ནར་བརྒྱད་བརྒྱ་འཐོབ་པར་འགྱུར་རོ། །མེ་ཏོག་ཀུ་མུ་ད་དང་།
en: If he offers one thousand and eight oblations of lotus stalks smeared with curds, honey, and ghee while in front of Noble Avalokiteśvara, he will obtain one hundred and eight dinars before the night is through.

source: པདྨ་སྡོང་བུ་དང་། རྩ་བ་དང་། འདབ་མར་བཅས་པ་དང་། ཡུངས་ཀར་བསྲེས་ཏེ་ཤིང་སེང་ལྡེང་གི་མེ་སྦར་ལ་སྦྱིན་སྲེག་བརྒྱ་རྩ་བརྒྱད་བྱས་ན། ལོག་འདྲེན་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: If he makes the fire of cutch wood and offers into it one thousand and eight oblations of white lilies with stalks, roots, and leaves smeared with mustard oil, he will be freed from all the vināyakas. “

source: །ཟླ་བ་ཡར་གྱི་ངོ་ཚེས་བརྒྱད་ལ་སྨྱུང་བ་བགྱི་སྟེ། གཙང་མས་ཁྲུས་ལེགས་པར་བྱས་ལ་གོས་དཀར་པོ་བགོས་ཏེ་ཙནྡན་དང་པྲི་ཡང་ཀུའི་ཤིང་དང་།
en: On the eighth day of the bright fortnight, the vidyā holder, observing a fast, should make himself ritually pure, bathe, and wear white clothes.

source: འབྲས་ཡོས་དང་། མར་དང་། ཡུངས་ཀར་བསྲེས་པའི་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ན།
en: He should offer one thousand and eight oblations of sandalwood and beautyberry sticks smeared with ghee and mustard oil.

source: ནམ་ཕྱེད་ཀྱི་དུས་སུ་གནོད་སྦྱིན་མོ་འོངས་ནས་ཟོང་ལྔ་སྟོང་སྦྱིན་པར་འགྱུར་རོ།
en: At midnight, a yakṣiṇī will arrive and offer five thousand pieces of silver. “

source: །ཟླ་བ་མར་གྱི་ངོ་ཚེས་བཅུ་བཞི་ལ་ཉིན་ཞག་གཅིག་སྨྱུང་བ་བྱས་ཏེ། རྒྱ་མཚོར་འགྲོ་བའི་ཆུ་ཀླུང་གི་འགྲམ་དུ་སོང་ལ། ཤིང་བིལ་བའི་མེ་སྤར་ཏེ།
en: On the fourteenth day of the dark fortnight, the vidyā holder, having fasted for one day and one night, should go to the bank of a river that empties into the ocean and make a fire using wood of the wood-apple tree.

source: ཤིང་བིལ་བའི་མེ་ཏོག་དང་མར་དང་སྦྲང་རྩི་བསྲེས་པ་སྟོང་རྩ་བརྒྱད་སྦྱིན་སྲེག་བྱས་ན། དེའི་འོག་ཏུ་གནོད་སྦྱིན་མོ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་འོང་བར་འགྱུར་རོ། །ནམ་ཕྱེད་ན་རིན་པོ་ཆེའི་ཟ་མ་ཏོག་ཐོགས་ནས་འོང་བར་འགྱུར་ཏེ། རིག་སྔགས་འཆང་དེས་བླང་བར་བྱའོ།
en: He should offer one thousand and eight oblations of wood-apple flowers smeared with ghee and honey into the fire until, at midnight, a yakṣa girl arrives, adorned with every ornament and holding a box full of jewels.

source: །གདོང་དུ་མིག་བལྟ་བར་མི་བྱའོ།
en: The vidyā holder should grasp that box without looking at the yakṣiṇī’s face and further recite the mantra one hundred and eight times.

source: །ཡང་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་པ་དང་རྐང་པའི་དྲུང་དུ་སྣོད་བོར་ནས་བཏུད་དེ་རིག་སྔགས་འཆང་འགུམ་མོ་ཞེས་ཟེར་རོ།
en: She will drop the box at her feet and say, ‘Vidyā holder, I am dying!’

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱའོ།
en: He should then incant the box with the Krodharāja mantra twenty-one times.

source: །དེ་ནས་གང་གི་ཚེ་དགོས་པ་བྱུང་བ་དེའི་ཚེ་ནམ་ཕྱེད་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ན་གནོད་སྦྱིན་མོ་འོང་བར་འགྱུར་ཏེ།
en: Subsequently, whenever there is a task to perform, he should recite the mantra at midnight one hundred and eight times.

source: དགོས་པ་ཐམས་ཅད་བྱེད་ཅིང་དྲན་བཞིན་དུ་ལས་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ།
en: The yakṣiṇī will then arrive and will perform every task. She will go wherever commanded and act as his servant. “

source: །ཟླ་བ་མར་གྱི་ངོ་ཚེས་བཅུ་བཞི་ལ་གང་ན་གཏེར་ཡོད་པ་དེར་སོང་སྟེ་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ལ།
en: On the fourteenth day of the dark fortnight, the vidyā holder should go to the place where treasure is hidden, recite the mantra one thousand and eight times, and offer a bali according to procedure.

source: གཏོར་མའི་ཆོ་ག་ཡང་གཞག་པར་བྱ་ཞིང་། འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པ་ལ་མཆོད་པ་བྱས་ལ་སྣ་མའི་མེ་ཏོག་དང་། པདྨའི་འདབ་མ་དང་། ཡུངས་ཀར་དང་། མར་བསྲེས་པ་རྣམས་ལས་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ཏེ།
en: He should make offerings to Noble Amogharāja and make one thousand and eight oblations of jasmine flowers, fruits, petals, and mustard seeds mixed with ghee.

source: ཆུ་དང་ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱས་ནས་ས་ལ་བརྡབས་ན།
en: Having incanted water and mustard seeds twenty-one times, he should throw them forcefully to the ground.

source: དེའི་འོག་ཏུ་གཏེར་ཐམས་ཅད་འབྱུང་བར་འགྱུར་ཏེ། བླངས་ལ་དཀོན་མཆོག་གསུམ་གྱི་སྐུ་སྐལ་དབུལ་བར་བྱ་ཞིང་ལྷག་མ་རང་གིས་བླང་བར་བྱའོ། །བ་རུ་རའི་ཤིང་གི་མེ་སྤར་ལ་ཏིལ་དང་། འབྲས་སོབ་དང་།
en: All treasures will then rise to the surface, and the vidyā holder should take them, offering one part to the Three Jewels and keeping the rest for himself. “

source: མར་བསྲེས་པ་ལས་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ན། རྒྱལ་པོ་བཙུན་མོའི་འཁོར་དང་བཅས་པ་དང་དཔུང་གི་ཡན་ལག་བཞི་དང་བཅས་པ་དང་། ནོར་དང་། འབྲུ་དང་བཅས་པ་དང་། དབྱིག་དང་། གསེར་དང་བཅས་པ་དབང་དུ་འགྱུར་ཏེ།
en: If the vidyā holder makes a fire with the wood of beleric myrobalan and offers into it one thousand and eight oblations of sesame and rice smeared with ghee, the king, his harem and retinue, and his entire army with its four divisions will come under the vidyā holder’s control, as will their money, grain, refined gold, and gold bullion.

source: ཇི་སྲིད་འཚོའི་བར་དུ་གནས་པར་འགྱུར་རོ། །ཡུངས་ཀར་དཀར་པོ་དང་། ཙམ་པ་ཀའི་མེ་ཏོག་དང་།
en: They will remain under his control for as long as he lives.

source: པདྨའི་ཡམ་སྲེག་ཤིང་དང་། སྦྲང་རྩི་དང་། མར་བསྲེས་པའི་སྦྱིན་སྟོང་རྩ་བརྒྱད་བྱས་ན་ཡུལ་ཐམས་ཅད་དབང་དུ་འགྱུར་ཞིང་། བུད་མེད་དང་། སྐྱེས་པ་དང་།
en: If the vidyā holder offers one thousand and eight oblations of white mustard, champak flowers, and lotus flowers smeared with ghee, all the inhabitants of the realm—women, men, boys, and girls—will fall under the vidyā holder’s thrall.

source: ཁྱེའུ་དང་། བུ་མོ་དབང་དུ་འགྱུར་རོ། །འབྲས་ཕུབ་ལན་ཚྭ་དང་ལྡན་པ་ལས་ལན་དགུ་བཅུ་རྩ་གཅིག་སྦྱིན་སྲེག་བྱས་ན། རིགས་བཞི་འཇིག་རྟེན་དབང་དུ་འགྱུར་རོ།
en: If he offers ninety-one oblations of rice chaff with salt, the people of all four castes will fall under his thrall. “

source: །ཨ་ག་ཏིའི་ཤིང་གིས་མེ་སྦར་ལ་སྦྲང་རྩི་དང་མར་བསྲེས་པ་དང་། ཨརྐའི་མེ་ཏོག་ལས་སྦྱིན་སྲེག་བརྒྱ་རྩ་བརྒྱད་བྱས་ལ།
en: The vidyā holder should make fire with the wood of hummingbird tree and offer into it one thousand and eight oblations of flowers of giant milkwood smeared with honey and ghee.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པ་བྱས་ན། ཉིན་རེ་བཞིན་དི་ན་ར་བརྒྱ་འཐོབ་པར་འགྱུར་རོ།
en: If he makes offerings to Noble Avalokiteśvara, he will obtain one hundred dinars every single day.

source: །པ་ལ་ཤའི་ཡམ་སྲེག་ཤིང་དང་འབྲལ་ཡོས་ལས་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ན། གསེར་བརྒྱ་ཕྲག་སྟོང་ཐོབ་པར་འགྱུར་རོ།
en: If he offers one thousand oblations of parched rice into a fire kindled with sticks from a flame-of-the-forest tree, he will obtain one thousand pieces of gold.

source: །དཀོན་མཆོག་གསུམ་ལ་མཆོད་པ་བྱ་ཞིང་བགོ་བཤའ་བྱས་ན་ཡང་འབྱུང་བར་འགྱུར་རོ།
en: Any portion of it that he offers to the Three Jewels will be restored to him. “

source: །ཚེས་བཅྭ་ལྔ་ཟླ་བ་ཉ་བ་ལ་སྨྱུང་བ་བྱས་ཏེ། རྒྱ་མཚོར་འབབ་པའི་ཆུ་ཀླུང་ངམ། ཆུ་ཀླུང་ཆེན་པོའི་ནང་རྐེད་པ་ནུབ་ཙམ་དུ་ཞུགས་ཏེ། ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ནས།
en: On the fifteenth day of the lunar fortnight, after fasting for a full day and night, the vidyā holder should wade waist deep into the water of a river that flows to the ocean and recite the mantra one hundred and eight times.

source: ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ན་ཁྲོས་པས་ཆུ་ཀླུང་དེ་ལ་བརྡབ་པར་བྱའོ།
en: He should then incant mustard seeds twenty-one times and angrily throw them into the water.

source: །དེ་ནས་ཆུའི་ནང་ནས་བུ་མོ་ཞིག་བྱུང་ནས་རིན་པོ་ཆེ་མང་པོ་ཞིག་སྦྱིན་པར་བྱེད་དེ་བླངས་ལ་ཕྱེད་ཀྱིས་དཀོན་མཆོག་གསུམ་ལ་མཆོད་པར་བྱ་ཞིང་།
en: A girl will emerge from the water and give the vidyā holder many jewels. He should take them and offer one half to the Three Jewels and to Noble Avalokiteśvara. “

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ཡང་མཆོད་པར་བྱའོ། །ཚེས་བཅྭ་ལྔ་ཟླ་བ་ཉ་བ་ལ་སྨྱུང་བ་བྱས་ཏེ། ནམ་ཕྱེད་ན་བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པ་བྱས་ནས།
en: On the fifteenth day of the lunar fortnight, the day of the full moon, the vidyā holder should make offerings to Noble Lord Avalokiteśvara after fasting for a full day and night.

source: ཨ་པ་མར་གའི་ཡམ་སྲེག་ཤིང་དང་། སྦྲང་རྩི་དང་། མར་དང་། སྲ་རྩི་པོག་སྲེག་པ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ལ།
en: He should then offer one thousand oblations of chaff-flower sticks smeared with honey, ghee, and the resin of the sal tree, and recite the mantra one hundred and eight times while focusing on his own name.

source: རང་གི་མིང་གིས་སྦྱིན་སྲེག་སྟོང་བྱས་ན་སྡིག་པ་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་ཞིང་ནད་ཐམས་ཅད་དང་། གནོད་པ་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་རོ། །ཕྱིར་རྒོལ་བ་ཐམས་ཅད་དང་། མི་མཛའ་བ་ཐམས་ཅད་འཇིག་པར་འགྱུར་རོ། །ཤིང་ཨརྐ་དང་།
en: All his evil deeds and obscurations will be cleared away, all diseases and ailments will be cured, and all his opponents and adversaries will be defeated. “

source: ཏི་ལ་དང་། ཡུངས་ཀར་དང་། གུ་གུལ་དང་། མར་བསྲེས་པ་ལས་སྦྱིན་སྲེག་བྱས་ན། ཞི་བ་ཆེན་པོར་འགྱུར་རོ།
en: If the vidyā holder offers one thousand and eight oblations with sticks of giant milkweed, sesame, and rice grains smeared with agarwood and ghee, the rite will effect great pacification.

source: །འབྲས་ཡོས་དང་། འོ་མ་དང་། མར་དང་། ཡུངས་ཀར་དང་། ཙནྡན་དཀར་པོ་བསྲེས་ལ་སྦྱིན་སྲེག་ལན་བརྒྱ་རྩ་བརྒྱད་བྱས་ན་རྒྱས་པ་དང་མཆོག་ཏུ་དགེ་བར་འགྱུར་རོ།
en: If he offers one hundred and eight oblations of parched rice mixed with milk, mustard seeds, ghee, and white sandalwood, it will be a most excellent and auspicious rite for nourishing.
